Revit 2027 API
PointCollection.GetPointIterator Method
 Creates and returns an iterator for the points contained in this collection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointIterator GetPointIterator()
Public Function GetPointIterator As PointIterator
public:
PointIterator^ GetPointIterator()
member GetPointIterator : unit -> PointIterator
Return Value
PointIterator
 New iterator created, make sure to call 'free' on it when finished using it.
See Also
Reference
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace